Qin/app/controllers/mentors_controller.rb

  def show
    @mentor = current_user
    @courses = Course.where(:user_id => @mentor.id)
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 3 LIMIT 1

  def createCourse
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("capacity", "created_at", "description", "location", "name", "price", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)