Qin/app/controllers/students_controller.rb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = 4
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT "courses".* FROM "courses"
---
  def show
    @student = current_user
    my_enrollments = Enrollment.where(:user_id => @student.id)
    my_courses = []
    my_enrollments.each do |e|
      my_courses << Course.find(e.course_id)
    end
    @my_courses = my_courses
    @courses = Course.all

INSERT INTO "enrollments" ("course_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["course_id", nil], ["created_at", Thu, 07 Nov 2013 06:57:32 UTC +00:00], ["updated_at", Thu, 07 Nov 2013 06:57:32 UTC +00:00], ["user_id", 4]]
---
  def addCourse
    @enrollment = Enrollment.create(:course_id => params[:course_id], :user_id => current_user.id)